const Logger = require("./log");
const logger = new Logger();

logger.on("some_event", (args) => {
  //метод on формирует функцию с аргументами со своими вычислениями внутри
  const { id, text } = args;
  console.log(id, text);
});

// а метод emit исполняет(вызывает) функцию "on" передавая значения аргументам

logger.logging("Erkin"); // вот здесь вот бл***(!) смотрика какая штука: Вот этот вот logger это "местная"-функция которая(отпучкованная от new Logger(экземпляр класса))описывает действия с аругментами здесь на странице "event-emitter.js" дальше через точку идет logging который был импортирован, там он тоже себе берет аргументы и еще выполняет emit logger.on,  т.е. функция описана на этом файле, емит с аргументами находится там, но вызывается здесь через logging

// итог, то что сначала мы формируем файл  log.js с наследованием и оттуда уже экспортируемся в файл event.emitter.js
