const { sayHi, userName } = require("./test"); // запросили {деструктурированно} данные из файла тест.жс потому что эта функция была экспортирована iz test.js

console.log(sayHi("Erkin")); // т.е тело функции с операциями выполняется из экспортированного файла, а здесь сама функция вызывается с аргументами
console.log(sayHi("Aida"));
console.log(sayHi(userName));

// у нод жс есть и встроенные модули которые помогают что-либо делатьили получать инфо.

// например чтобы получать информацию об операционной системе можно импортировать встроенный модуль с имененм "os"

const os = require("os"); // вот он

console.log(os.platform(), os.release()); 
